{"pageProps":{"note":{"id":"7q7g9eix5c7adk4h8hy4vqp","title":"The Super Mario Effect Tricking Your Brain into Learning More","desc":"","updated":1683596864482,"created":1683596292281,"custom":{},"fname":"book-summaries.youtube.the-super-mario-effect-tricking-your-brain-into-learning-more","type":"note","vault":{"fsPath":"vault"},"contentHash":"27c7a1f86adfaa8644dc473f31eff658","links":[],"anchors":{"summary":{"type":"header","text":"Summary","value":"summary","line":10,"column":0,"depth":2},"problem--solution":{"type":"header","text":"Problem & Solution","value":"problem--solution","line":14,"column":0,"depth":2},"takeaways":{"type":"header","text":"Takeaways","value":"takeaways","line":20,"column":0,"depth":2},"transcript":{"type":"header","text":"Transcript","value":"transcript","line":32,"column":0,"depth":2}},"children":[],"parent":"tl8lc3dlcmt97609fjhhi8o","data":{}},"body":"<h1 id=\"the-super-mario-effect-tricking-your-brain-into-learning-more\">The Super Mario Effect Tricking Your Brain into Learning More<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#the-super-mario-effect-tricking-your-brain-into-learning-more\"></a></h1>\n<p>Link: <a href=\"https://www.youtube.com/watch?v=9vJRopau0g0\">https://www.youtube.com/watch?v=9vJRopau0g0</a></p>\n<h2 id=\"summary\">Summary<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#summary\"></a></h2>\n<p>Dalam presentasi ini, Mark Rober berbicara tentang prinsip \"Super Mario Effect\" yang dapat membantu seseorang mengatasi rasa takut akan kegagalan dan meningkatkan kemampuan belajar. Dengan memfokuskan pada tujuan akhir yang menarik, seseorang dapat melepaskan rasa takut akan kegagalan dan belajar lebih alami. Mark juga menekankan bahwa kegagalan adalah bagian dari proses belajar dan sukses, dan bahwa sikap bermain game seperti dalam Super Mario dapat membantu seseorang memperbaiki diri dan memecahkan masalah dalam kehidupan nyata. Dalam presentasi ini, Mark juga menyajikan contoh dari kehidupannya sendiri dan bagaimana prinsip Super Mario telah membantunya mencapai kesuksesan.</p>\n<h2 id=\"problem--solution\">Problem &#x26; Solution<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#problem--solution\"></a></h2>\n<p>Pada video itu, Ada problem yang dijelaskan yaitu \"fear of failure\" atau ketakutan akan kegagalan. Masalah ini dapat menghambat proses pembelajaran dan membuat seseorang ragu-ragu dalam menghadapi tantangan ke depan.</p>\n<p>Solusi yang dijelaskan dalam video tersebut adalah dengan mengubah cara pandang terhadap proses pembelajaran dan fokus pada tujuan akhir yang menarik, sehingga ketakutan akan kegagalan bisa dihilangkan dan pembelajaran dapat menjadi lebih alami. Selain itu, video juga memberikan contoh tentang bagaimana menghadapi kegagalan dengan cara yang lebih konstruktif, yaitu dengan menggunakan analogi permainan video untuk merangkul kegagalan sebagai bagian dari proses belajar dan merencanakan cara untuk mencoba lagi dan lebih baik ke depannya.</p>\n<h2 id=\"takeaways\">Takeaways<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#takeaways\"></a></h2>\n<ul>\n<li>\n<p>Menjadi terlalu fokus pada kesuksesan dan mencoba menghindari kegagalan dapat membuat proses pembelajaran menjadi lebih sulit. Dengan memfokuskan diri pada tujuan akhir yang menarik, rasa takut akan kegagalan seringkali dapat dihilangkan dan pembelajaran akan terasa lebih alami.</p>\n</li>\n<li>\n<p>Kita seringkali berharap bahwa kehidupan akan selalu seperti gambaran atas, tetapi kehidupan sebenarnya lebih mirip dengan gambaran bawah. Kegagalan dan rintangan yang kita hadapi sebenarnya merupakan bagian penting dari proses belajar dan tumbuh.</p>\n</li>\n<li>\n<p>Terkadang kita harus belajar untuk memandang tantangan hidup seperti bermain game. Dengan berfokus pada tujuan akhir dan melihat setiap kegagalan sebagai kesempatan untuk belajar dan mencoba lagi, kita dapat membangun keterampilan dan kepercayaan diri.</p>\n</li>\n<li>\n<p>Kegagalan bukanlah tanda bahwa kita tidak cukup baik atau cerdas. Sebaliknya, kegagalan merupakan kesempatan untuk belajar dan tumbuh. Kebanyakan pencapaian yang berarti dalam hidup kita berasal dari banyak kegagalan yang kita alami sebelumnya.</p>\n</li>\n<li>\n<p>Prinsip yang dijelaskan di atas dapat diterapkan pada berbagai aspek kehidupan, baik itu dalam pendidikan, hubungan, atau pencapaian profesional. Semua orang akan memiliki cara yang berbeda-beda dalam menerapkannya dalam kehidupan mereka, tetapi prinsip ini memiliki potensi universal untuk membantu kita mencapai kesuksesan.</p>\n</li>\n</ul>\n<h2 id=\"transcript\">Transcript<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#transcript\"></a></h2>\n<p>Translator: Jeesun Youn Reviewer: Lisa Thompson\nAbout a year ago, I asked my YouTube followers to play a simple computer programming puzzle that I made with a buddy.\nThe object of the puzzle was to get your car across the maze by arranging these code blocks\nthat represent typical computer programming operations, such as if-else statements and while loops.\nOnce you thought you had a good code, you would hit Run, and your car would move based on the commands you had in the program.\nI asked my YouTube followers to play it because I said I wanted to prove that anyone from any background could learn to code.\nFifty thousand of them took the challenge and attempted the puzzle.</p>\n<p>But the truth was that I didn't actually care about proving that anyone could learn to code.\nWhat they didn't know is that we actually randomly served up two slightly different versions of the puzzle.\nIn one version, if you hit Run and you weren't successful, you didn't lose any of your starting 200 points.\nWe showed you this message.</p>\n<p>[Please try again.]\nHowever, in the other version, if you hit Run and again you weren't successful,\nwe showed this slightly different message, stating that you lost five points from your starting 200 points.\nThat was the only difference. In one version, if you failed, we simply took away five no-value-in-the-real-world,\nno-one-will-ever-see-these, completely meaningless, fake internet points.\n(Laughter)</p>\n<p>That minor difference is crucial to keep in mind for the results I'm about to show you from the 50,000 data points we collected.\nFor those who were penalized for failed attempts, their success rate was around 52%.\nFor those who were not penalized, their success rate was 68%.\nThat statistically significant delta of 16% was really surprising and almost seemed too hard to believe\nuntil we looked at another piece of data that we collected, which was attempts to solve before finding success.</p>\n<p>It's shown in orange right here. So, those who didn't see failing in a negative light nearly had two and a half times more attempts to solve the puzzle.\nAs a result, naturally, they saw more success and therefore learned more. So if you think about that and sort of unpack these results,\nthe trick to learning more and having more success is finding the right way to frame the learning process.\nAnd this observation seemed really profound to me. It made me wonder, What if you just frame the learning process in such a way\nthat you did not concern yourself with failure, how much more successful could you be, how much more could you learn?\nThe next thought was that if this is a real effect, clearly there must be some evidence for this in real life.</p>\n<p>It made me think of toddlers.\nThat's my boy; I helped make that.\n(Laughter)</p>\n<p>They are constantly trying new things, and they certainly aren't concerned with failure.\nWhen my son learned to walk, he didn't think about how dumb he might look if he fell down,\nand as his parents, we didn't punish him if he wasn't successful either.\nThe focus was always on the end goal, and we celebrated the successes with him.\nAs a result of constantly failing and trying and discovering new things during that phase of our life,\nwe discover so many more new capabilities within ourselves, and it's not even close to any other time in our life.\nBut maybe using a toddler is sort of cheating because their brains are different than ours.\nTo make the case that perhaps they aren't that different than us, I'd like to tell you about a plumber I first met when I was eight years old.</p>\n<p>He was Italian.\n(Power up sound effect)\n(Laughter)</p>\n<p>When Super Mario Bros. came out, my friends and I became obsessed - like, we wanted to get to the castle and rescue the beautiful Princess Peach from the evil Bowser. We'd get to school and ask each other, \"Dude, what level did you make it to? Did you pass the game?\"\nWe never asked each other about details on all the different ways we might have died. When it comes to games like this,\nno one ever picks up the controller for the first time and then after jumping into a pit thinks,\n\"I am so ashamed; that was such a failure,\" and they never want to try again, right?\nWhat really happens is they think, \"I've got to remember there's a pit there; next time, I'm going to come out with a little more speed and jump a bit later.\"\nThe focus and the obsession is about beating the game, not how dumb you might look if you get hit by a sliding green shell.\nAnd as a direct result of that attitude of learning from but not being focused on the failures,\nwe got really good, and we learned a ton in a very short amount of time.\nWe were the right side of this graph. This is what I call the Super Mario Effect:\nfocusing on the princess and not the pits to stick with a task and to learn more.\nThis caused me to reflect and realize that there were lots of other examples\nfrom my own personal experience where this attitude of life gamification,\nthis Super Mario Effect led to more success and therefore more learning.\nI have a science YouTube channel where I will sometimes use my engineering skills\nto build things such as the world's largest Super Soaker or the Guinness World Record world's largest Nerf gun.\n(Video) (Screaming)</p>\n<p>(Audience) (Laughter)\n(On stage) Mark Rober: Or maybe this snowball machine gun.\n(Video) MR: Ha, ha, ha. Yes!\n(On stage) MR: Fashioned from a leaf blower.\n(Audience) (Laughter)\nThat's my niece.\nThose are my nephews.\n(Laughter)\nI haven't quite figured it out,\nbut when it comes to me, their uncle, they seem to have some trust issues.\n(Laughter)</p>\n<p>So, these builds usually take me about two to three months, but there was one that took me three years.\nBasically, I wanted to make a dartboard where you could get a bullseye every time.\nThe idea was that if you throw a dart, we could track it through the air, and then we'd move the board to sort of catch a bullseye.\n(Laughter)</p>\n<p>And so, once we did the math, we realized that if we wanted to track the dart for a typical, like, game of darts, typical velocity,\nwe would basically have to both track the dart and move the board in the same amount of time it takes for a human to blink once.\nNo big deal, right?</p>\n<p>I'm not going to bore you with all the details and the failures and the setbacks from a lot of metaphorical sliding green shells\nand those pesky Hammerhead Bros, but eventually we figured out it would take something that looks like this,\nwhich is six stepper motors and motion controllers, a Vicon motion capture system with six cameras, and just a ton of tweaking and rewriting the code.\nBut finally, eventually, we arrived here.\n(Applause)</p>\n<p>What's interesting is when I look back on that process, like, I can honestly say my attitude towards that was the same attitude I had toward, like, rescuing the princess from Bowser.\nLike, of course, each failure and setback sucked; it stung.\nBut it was no different than falling in that pit on Level 8-1, and you're like, \"Argh,\" and you got to go back and try again.\nIt was always like, \"OK, that sucked, but what did we learn from that? What can we do next for it? Let's hit it again.\"\nAnd this concept of life gamification is more than just, like, \"Have a positive attitude\" or \"Never give up\"\nbecause those sort of imply you're having to endure against your true desire to quit.\nI feel like when you frame a challenge or a learning process in the way I'm describing, you actually want to do it.\nIt feels natural to ignore the failures and try again, in the same way a toddler will want to get up and try and walk again or in the same way you want to keep playing Super Mario Bros.\nor in the same way the group on the right had a desire to stick with that puzzle two and a half times longer.</p>\n<p>They weren't getting paid to do that. Nobody was forcing them or watching them.\nIt was just them on their computer, alone in their house. Their outlook made it so they wanted to keep trying and learning.\nThe icing on the cake for the dartboard was I took it on Jimmy Kimmel and challenged him to a game of darts.\nI'll just set this clip up by saying two things. The first is we also had a mode on the board where if your buddy had it and threw a dart, the board would move the other way.\n(Laughter)</p>\n<p>And the second is that we couldn't get this thing working during rehearsal, and it was just barely kind of creeping along.\nI get up to stand in the elevator, which is the door that moves up before you go down out on stage.\nI look to the right, all six cameras had failed.\nSo my buddy John is feverishly, like, restarting all the cameras as I'm going out onto stage knowing this, and there's, like, four things and bits, and I work up to the dartboard as the sort of grand finale.\nSo just keep that in mind as this clip starts.\nLike, that's where my headspace is. Three freaking years, and it comes down to this moment.</p>\n<p>(Video) MR: What you're going to do is give this dart to your buddy, and you're going to challenge him just to, like, hit the board.\nJimmy Kimmel: Just try to hit the board. OK. Alright.\n(Laughter)\nMR: Alright, hot shot. Double or nothing?\nJK: Alright, yeah, yeah, alright. Ready?\n(Laughter)\nOK.\nMR: Alright. And so, then I step up here. JK: This does this automatically?\nMR: That's right. JK: And you built this?\nMR: That's right. I step up.\nHere we go.\n(Cheers) (Applause)\n(On stage) MR: Fake it till you make it.\n(Laughter)</p>\n<p>I will say, in all of our testing, literally, we never had a dead-center bullseye\nas much as that one right there. So, like, after that, I haven't even touched the board since.\nI'm like, \"I'm so done with it.\"\n(Laughter)</p>\n<p>And I really believe that if you reframe, like, the challenges,\nit can make all the difference.\nI have a simple thought experiment to sort of showcase this.\nLet's say I gave you a test and it had instructions on it that you would carry out,\nand to do that, it had sort of buttons like this.\nAnd the instructions would say something like, \"Push button 3 for 5 seconds\" and then, \"Push button 6 for 1 second,\" then, \"Push buttons 3 and 5 for 6 seconds,\" and so on.\nAnd unless you carried out the instructions on page one exactly, you couldn't see the other 32 pages of the test.\nHow much would I have to pay you to take that test for an hour?\nNow suppose I change the word \"test\" here to \"game,\"\nand I rotated this, and for the input device, I shrunk the buttons and moved them here,\nand I gave it a cool paint job and maybe different button styles.\nAnd then instead of using words, I represented the tasks you needed to accomplish visually like this.</p>\n<p>Note the output is the exact same:\nyou have to push these buttons in a very specific manner to move on to the next page or level, as it were.\nNow picture it's 1986. How much would you pay me to take this test just for an hour?\nIf you have a very bad imagination, here's a hint to the right answer.\nI know. I was there.\n(Video) Boy: Nintendo!\n(Crying)\nOh, Dad, thank you.\nThank you!\nDad: Don't come and hug me, go play with it!\nBoy: (Crying)\n(Audience) (Laughter)\n(On stage) MR: That has to be the greatest YouTube clip of all time.\n(Laughter)</p>\n<p>So, as a science YouTuber, sometimes I feel people have framed the act of learning science in a negative way.\nIt's been taught poorly, so it feels scary to them.\nIt feels something more like this.\nAnd my approach is to take the same physics lessons you might have hated and to try and sort of trick you into learning something through something cool: basically to go from this to this.\nSo for example, in this video, I made a hot tub with liquefied sand.\nAnd this is another one of my nephews with unexplained trust issues.\n(Laughter)</p>\n<p>I explain in the video that it's a fluidized bed, and then we talk about the principle of buoyancy and how it makes the whole thing work,\nand I use several examples, like, you know, the blow-dryer with a ping-pong ball like this.\nI like to think my approach to science is similar to Velociraptor hunting patterns.\nSo, I get people to come in with something cool and amazing like the sand hot tub, and then when they least expect it -</p>\n<p>(Video) (Music)\n(Growling)\nRobert Muldoon: Clever girl.\n(On stage) MR: Admittedly, the analogy breaks down a little bit right there at the end.</p>\n<p>But by reframing the learning process and focusing on the cool end goal, the fear of failure is often taken off the table, and learning just comes more naturally.\nI'll close with this thought. Someone came up with this cartoon, and I totally love it.\nThis is so true, but often in life we tell ourselves that the top version is what we want;\nthat's what we expect. But then something happens. Maybe it's a really bad grade on a test or a meeting with a client that goes horribly wrong.\nMaybe it's a bad breakup. Maybe we miss a wide-open shot.\nSome kind of green shell hits you. And so, at that first setback or sign of failure, doubt creeps in.\nWe tell ourselves we're not good enough or we're not smart enough. And yet, if the bottom rectangle here is a game where now your bikes crash\nand you have to get your bike across to the flag, it's not, \"Oh, I hit these rocks. I'm just going to leave my bike here.\nI'm not good enough,\" and you quit and walk away. You see that flag to the right,\nand you're like, \"Nah, what did I just learn? OK, next time, I'm going to come out with more speed\nand lift the front of my bike up.\" You want to try it again.\nYou're immediately excited to go for it again. We sort of tell ourselves\nwe want our life's challenges to look like the top one, but that's boring.\nIf that were a real video game or a book or a movie and that went out to the market, it would be a total failure.\nNobody would buy it.\nWhere's the risk and the reward? Where's the challenge?\nThere's no feeling of satisfaction.\nThe bottom picture is real life, and that's not a bug, that's a feature.\nThink about anything that means anything to you in life,\nwhether it's a degree,\na relationship with a friend or someone in your family,\nmaybe a professional accomplishment.\nI can guarantee you it came from something that looks like the bottom\nand not the top:\nfailing and failing and failing and eventually succeeding\nto the point that it now holds value,\njust like the most meaningful high-fives of my adolescence were those when I said,\n\"Dude, I finally beat Bowser last night.\"\nI feel like a lot of the successes in my life\nhave come down to the Super Mario Effect,\nand while framing challenges like this has worked for me,\nof course, results may vary.\nEveryone is going to be different,\nand I don't know exactly what it looks like for you to take this principle\nand map it into your life.\nBut if we got these very real results\nfrom a very different cross-section of very unique people,\nclearly I'm not alone.\nThere's some universal principle at play here.\nBy shifting your focus to the princess\nand treating your life's challenges like video games,\nyou can trick your brain and actually learn more\nand see more success.\nThank you.</p>","noteIndex":{"id":"oqxmejlafk9x8rj9t5hya5z","title":"Hi 👋","desc":"","updated":1721116613997,"created":1646842475821,"custom":{"nav_order":0,"permalink":"/"},"fname":"root","type":"note","vault":{"fsPath":"vault"},"contentHash":"64c62caa2f0c02c2d68a5a2d826cc01e","links":[],"anchors":{"welcome-to-sotoy":{"type":"header","text":"Welcome to Sotoy","value":"welcome-to-sotoy","line":8,"column":0,"depth":1},"lookup":{"type":"header","text":"Lookup","value":"lookup","line":12,"column":0,"depth":2}},"children":["spfwom01chbihki1twghclf","bsv930j2j6qlih60c7eu7wh","ohf85tu5nw2b8ewx6cetsmp","u3lhhpriar8wgcjw8svapha","tvdcga33h6hi7fxd9cwqd66","t58wEmhAtf1GlHmO","7zg3n4r3gbx8z3mf2c378oe","91eqybfohputr1iaxqbsbfe","xfsiepyapo4o9u17mvwwmmz","7udjlx2925dhyxgkrntgcbz","x1aw4xgjnlqqzeww7dkz75g","kkrg5dvp14ul4h2j68cuu95","db4vfvorjwy8z1bc5ebav17","rsf7zz4x6mwvwv4nfvx7njy","zo3yef1gdturl68e9vloyxg","awio361hzb2j58dcdulmpva"],"parent":null,"data":{},"body":"\n# Welcome to Sotoy\n\nThis is the root of your dendron vault. If you decide to publish your entire vault, this will be your landing page. You are free to customize any part of this page except the frontmatter on top.\n\n## Lookup\n\nThis section contains useful links to related resources.\n\n- [Getting Started Guide](https://link.dendron.so/6b25)\n- [Discord](https://link.dendron.so/6b23)\n- [Home Page](https://wiki.dendron.so/)\n- [Github](https://link.dendron.so/6b24)\n- [Developer Docs](https://docs.dendron.so/)\n"},"collectionChildren":null,"customHeadContent":null,"config":{"version":5,"dev":{"enablePreviewV2":true},"commands":{"lookup":{"note":{"selectionMode":"extract","confirmVaultOnCreate":true,"vaultSelectionModeOnCreate":"smart","leaveTrace":false,"bubbleUpCreateNew":true,"fuzzThreshold":0.2}},"randomNote":{},"insertNoteLink":{"aliasMode":"none","enableMultiSelect":false},"insertNoteIndex":{"enableMarker":false},"copyNoteLink":{"aliasMode":"title"},"templateHierarchy":"template"},"workspace":{"dendronVersion":"0.83.0","vaults":[{"fsPath":"vault"},{"fsPath":"templates","seed":"dendron.templates","name":"dendron.templates","visibility":"private"},{"fsPath":"vault2","name":"vault-private","sync":"sync","visibility":"private","remote":{"type":"git","url":"git@github.com:zeihanaulia/journal.git"}}],"journal":{"dailyDomain":"daily","name":"journal","dateFormat":"y.MM.dd","addBehavior":"childOfDomain"},"scratch":{"name":"scratch","dateFormat":"y.MM.dd.HHmmss","addBehavior":"asOwnDomain"},"task":{"name":"","dateFormat":"","addBehavior":"childOfCurrent","statusSymbols":{"":" ","wip":"w","done":"x","assigned":"a","moved":"m","blocked":"b","delegated":"l","dropped":"d","pending":"y"},"prioritySymbols":{"H":"high","M":"medium","L":"low"},"todoIntegration":false,"createTaskSelectionType":"selection2link","taskCompleteStatus":["done","x"]},"graph":{"zoomSpeed":1,"createStub":false},"enableAutoCreateOnDefinition":false,"enableXVaultWikiLink":false,"enableRemoteVaultInit":true,"enableUserTags":true,"enableHashTags":true,"workspaceVaultSyncMode":"noCommit","enableAutoFoldFrontmatter":false,"enableEditorDecorations":true,"maxPreviewsCached":10,"maxNoteLength":204800,"seeds":{"dendron.templates":{}},"enableFullHierarchyNoteTitle":false},"preview":{"enableFMTitle":true,"enableNoteTitleForLink":true,"enableFrontmatterTags":true,"enableHashesForFMTags":false,"enablePrettyRefs":true,"enableKatex":true,"automaticallyShowPreview":false},"publishing":{"enableFMTitle":true,"enableNoteTitleForLink":true,"enablePrettyRefs":true,"enableKatex":true,"copyAssets":true,"siteHierarchies":["root"],"writeStubs":true,"siteRootDir":"docs","seo":{"title":"Sotoy","description":"Personal knowledge space about anything I learn. Notes, knowledge, and ideas from me.","author":"Zeihan Aulia","twitter":"zeihanaulia","image":{"url":"https://pbs.twimg.com/profile_images/502375255256485888/1UYtt7PT_400x400.jpeg","alt":"Software Engineer, "}},"github":{"enableEditLink":true,"editLinkText":"Edit this page on GitHub","editBranch":"main","editViewMode":"tree"},"enableSiteLastModified":true,"enableFrontmatterTags":true,"enableHashesForFMTags":false,"enableRandomlyColoredTags":true,"enableTaskNotes":true,"enablePrettyLinks":true,"searchMode":"lookup","assetsPrefix":"/sotoy","siteUrl":"https://zeihanaulia.github.io","duplicateNoteBehavior":{"action":"useVault","payload":["vault-private","vault","dendron.templates"]},"siteFaviconPath":"favicon.ico","siteIndex":"root"}}},"__N_SSG":true}