{"pageProps":{"note":{"id":"oorvvxz032oov7psrw9ygte","title":"Self Driving","updated":1721120039367,"created":1646854981225,"tags":["Self Improvement","Rhenald Kasali"],"desc":null,"custom":{},"fname":"book-summaries.self-driving","type":"note","vault":{"fsPath":"vault"},"contentHash":"47a840a8e0777676ed69fc30d6d02445","links":[{"type":"frontmatterTag","from":{"fname":"book-summaries.self-driving","id":"oorvvxz032oov7psrw9ygte","vaultName":"vault"},"value":"tags.Self Improvement","alias":"Self Improvement","xvault":false,"to":{"fname":"tags.Self Improvement"}},{"type":"frontmatterTag","from":{"fname":"book-summaries.self-driving","id":"oorvvxz032oov7psrw9ygte","vaultName":"vault"},"value":"tags.Rhenald Kasali","alias":"Rhenald Kasali","xvault":false,"to":{"fname":"tags.Rhenald Kasali"}},{"type":"wiki","from":{"fname":"book-summaries.self-driving","id":"oorvvxz032oov7psrw9ygte","vaultName":"vault"},"value":"tags.self-improvement","alias":"#self-improvement","position":{"start":{"line":2,"column":1,"offset":1},"end":{"line":2,"column":18,"offset":18},"indent":[]},"xvault":false,"to":{"fname":"tags.self-improvement"}},{"type":"wiki","from":{"fname":"book-summaries.self-driving","id":"oorvvxz032oov7psrw9ygte","vaultName":"vault"},"value":"tags.rhenald-kasali","alias":"#rhenald-kasali","position":{"start":{"line":3,"column":1,"offset":19},"end":{"line":3,"column":16,"offset":34},"indent":[]},"xvault":false,"to":{"fname":"tags.rhenald-kasali"}}],"anchors":{"kata-pengantar":{"type":"header","text":"Kata Pengantar","value":"kata-pengantar","line":17,"column":0,"depth":2},"01-ini-soal-mandataris-kehidupan":{"type":"header","text":"01: Ini Soal Mandataris Kehidupan","value":"01-ini-soal-mandataris-kehidupan","line":48,"column":0,"depth":2},"02-manusia-berpikir":{"type":"header","text":"02: Manusia Berpikir","value":"02-manusia-berpikir","line":105,"column":0,"depth":2},"03-mengapa-kaum-muda-memilih-universitas":{"type":"header","text":"03: Mengapa Kaum Muda Memilih Universitas","value":"03-mengapa-kaum-muda-memilih-universitas","line":212,"column":0,"depth":2},"04-dua-jenis-penumpang-bad-and-good-passangers":{"type":"header","text":"04: Dua Jenis Penumpang: Bad And Good Passangers","value":"04-dua-jenis-penumpang-bad-and-good-passangers","line":261,"column":0,"depth":2},"05-dua-jenis-pengemudi-bad-and-good-drivers":{"type":"header","text":"05: Dua Jenis Pengemudi: Bad And Good Drivers","value":"05-dua-jenis-pengemudi-bad-and-good-drivers","line":294,"column":0,"depth":2},"06-self-dicipline":{"type":"header","text":"06: Self Dicipline","value":"06-self-dicipline","line":358,"column":0,"depth":2},"07-ambilah-resiko":{"type":"header","text":"07: Ambilah Resiko","value":"07-ambilah-resiko","line":359,"column":0,"depth":2},"08-play-to-win":{"type":"header","text":"08: Play to Win","value":"08-play-to-win","line":360,"column":0,"depth":2},"09-the-power-of-simplicity":{"type":"header","text":"09: The Power Of Simplicity","value":"09-the-power-of-simplicity","line":361,"column":0,"depth":2},"10-creative-thinking":{"type":"header","text":"10: Creative Thinking","value":"10-creative-thinking","line":362,"column":0,"depth":2},"11-critical-thinking":{"type":"header","text":"11: Critical Thinking","value":"11-critical-thinking","line":363,"column":0,"depth":2},"12-growth-mindset":{"type":"header","text":"12: Growth Mindset","value":"12-growth-mindset","line":364,"column":0,"depth":2},"13-epilog":{"type":"header","text":"13: Epilog","value":"13-epilog","line":365,"column":0,"depth":2}},"children":[],"parent":"spfwom01chbihki1twghclf","data":{}},"body":"<h1 id=\"self-driving\">Self Driving<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#self-driving\"></a></h1>\n<p><a class=\"color-tag\" style=\"--tag-color: #840000;\" href=\"/sotoy/notes/8mz3dc3neqofv79za5ey5jp\">#self-improvement</a>\n<a class=\"color-tag\" style=\"--tag-color: #7b002c;\" href=\"/sotoy/notes/2s2ic9ajltco1l0einjx23g\">#rhenald-kasali</a></p>\n<p>Buku ini ditulis oleh Bapak Rhenald Kasali, Ph,D., Beliau adalah seorang guru besar FEUI, Praktisi Management dan Penulis Buku.\nDitulis pada </p>\n<h2 id=\"kata-pengantar\">Kata Pengantar<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#kata-pengantar\"></a></h2>\n<p>Dunia usaha menghendaki manusia-manusia berkarakter driver yang berkompetensi, namun juga cekatan, gesit, berinisiatif dan kreatif.\nMasalahnya tanpa disadari kampus-kampus saat ini malah membentuk manusia-manusia menjadi passenger.\nKaum mudanya cenderung pandai namun outputnya adalah manusia-manusia penumpang.\nYang dimana fokus mereka hanyalah text book atau memindahkan pengetahuan dari buku ke kertas ujian.\nJadi pintar itu adalah pintar kertas dan sarjananya sangat mungkin menjadi sarjana kertas.</p>\n<p>Berbeda dengan para TKI diluar negri (Hongkong, Jepang, Taiwan), mereke mungkin tidak bersekolah tinggi,\ntapi mereka dipaksa lingkungan untuk berpikir kritis menghadapi dunia baru yang sangat menuntut.\nMereka melatih kegesitan, belajar dari kehidupan.</p>\n<p>Dengan tuntuntan dan tantangan seperti itu akan mengasilkan manusia-manusia driver,tak ada waktu bagi mereka untuk diam.\nSeperti ucapan Syekh Mohammand Al-Mahtum yang membuat dasar-dasar perubahan di Dubai, dia berkata.</p>\n<blockquote>\n<p>Kita ini seperti rusa di padang sabana yang dikelilingi harimau yang siap memangsa.\nKalau tidak bisa lari lebih kencang, maka kita akan menjadi mangsa mereka.</p>\n</blockquote>\n<p>Intinya adalah tentang mengubah mentalitas dan ini bukan lah perubahan yang mudah.</p>\n<p>Pertanyaannya,</p>\n<ul>\n<li>Bagaimana cara melatihnya?</li>\n<li>Sudah tepatkan cara-cara yang dilakukan oleh pusat pelatihan? (sekolah, universitas)</li>\n<li>Apakah dengan memberikan ilmu berupa pengatahuan manajerial mereka otomatis akan mendapatkan kompetensi?</li>\n</ul>\n<blockquote>\n<p>Orang jujur itu mujur. Tetapi jujur dan disiplin seperti sekeping koin dengan dua sisi, saling melengkapi.\nKarena kejujuran harus menjadi komitmen dan komitment dibentuk oleh Self Discipline.\nInilah modeal dasar Self Driver</p>\n<ul>\n<li>Iwan Setiawan, CEO PT Rintis Sejahtera</li>\n</ul>\n</blockquote>\n<h2 id=\"01-ini-soal-mandataris-kehidupan\">01: Ini Soal Mandataris Kehidupan<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#01-ini-soal-mandataris-kehidupan\"></a></h2>\n<p>Kita semua adalah pemeang mandat kehidupan. Sewaktu dilahirkan, Tuhan hanya bersabda, \"Inilah hidupmu\" setelah itu jelajahi sendiri.\nKarena suratnya dipegang orangtua lebih dulu, mereka ditugasi untuk memelihara dengan penuh kesungguhan.\nSetelah itu, suratnya pun dikembalikan dan pemegangnya bisa memilih untuk menjelajahi kehidupan itu engan penuh tantangan atau diam saja sebagai penumpang.</p>\n<p>Menjelajahi kehidupan berarti bertarung menghadapi tantangan dan perubahan, seperti seorang pengendara yang tak bebas dari resiko.\nKadang ia tergores, berbenturan dengan kendaraan lain. Dan kalau kecelakaan dialah yang diadili, bukan penumpangnya.\nSebaliknya, untuk menjadi penumpang, Lo boleh mengantuk, tertidur, terdiam, tak perlu tahu arah jalan, bahkan tak perlu merawat kendaan sama sekali.</p>\n<p>Ada yang menggunakan surat mandat itu untuk tumbuh dan berkarya ada juga yang cuma menyimpan surat itu didalam sakunya sebagai dokumen pribadi.\nKedua duanya sama-sama mempunyai mandat, tapi keberadaannya berbeda. Dan tentu saja hidupnya berbeda.\nSebagian orang bilang nasib dan yang lain bilang ini adalah pergulatan hidup yang diawali dengan ada atau tidaknya kesadaran mandataris itu sendiri.</p>\n<p>Sesuatu yang ada pada diri lo, ya itulah kendaraan lo. Ia menjelma menjadi kekuatan mencipta, berkarya, berprestasi dan berkreasi.\nKita menyebutnya sebagai gabungan antara kompetensi (apa yang lo bisa), kecekatan dan perilaku.</p>\n<p>Kalo lo kuliah atau sertifikasi dan merasa dengan label-label itu akan membuat lo sukses, lo salah.\nJangan jual label-label itu, tapi jualah apa yang lo bisa lakuin. Tahu bukan berarti bisa.</p>\n<p>Jadilah driver, Driver adalah sebuah sikap hidup yang membedakan dirinya dari passenger.\nLo tinggal memilih, ingin duduk manis, menjadi penumpang dibelakang atau mengambl resiko sebagai driver di depan?</p>\n<p>Ada tiga hal yang harus dilakukan yaitu,</p>\n<ul>\n<li>Men-drive diri sendiri</li>\n<li>Men-drive orang lain</li>\n<li>Men-drive bangsa</li>\n</ul>\n<p>Kalau lo tidak bisa men-drive diri lo sendiri, bagaimana lo bisa men-drive orang lain? dan berarti gak ada kepemimpinan dari diri lo.</p>\n<p>Seorang driver bisa hidup dimana pun mereka berada dan selalu menumbuhkan harapan.\nMereka selalu mengajak orang untuk terus berkembang selalu melakukan pembaharuan.\nMereka berinisiatif memulai perubahan tanpa ada yang memerintahkan, namun tetap rendah hati dan kaya empati.\nSeorang driver harus seimbang antara logic (rasionalitas, hitung-hitungan, analisis dan targetnya) dengan hatinya (empati).\nMereka adalah orang tau arah dan resiko yang akan dihadapi.\nSedangkan passanger adalah orang orang yang terbelenggu dengan fix mindset.</p>\n<p>Kesadaran yang dibentuk oleh pengalaman dan pendidikan itulah maksud dari driver mentality.\nPendidikan diperlukan untuk memperbaiki cara berpikir dan cara menjalani hidup yang menantang.\nBelajar artinya berpikir. Kalo lo ambil pendidikan cuma buat menghapal, ya lo rugi sih.\nIPK lo gak akan ada artinya kalo lo gak bisa berpikir dan cuma manfaatin hapalan aja.</p>\n<p>Berpikir juga gak ada batas waktunya, gak pernah berhenti cuma karena lo udah dapet ijasah.\nBagaimana lo bisa berpikir kalo lo gak berani ambil resiko?\nMenjadi driver sama dengan mengekspos diri lo terhadap resiko.\nTapi resiko itu hanya akan jadi masalah kalo lo ugal-ugalan.</p>\n<p>Ketika lo udah takut buat melakukan \"kesalahan\" kecil, lo akan masuk kedalam mentalitas penumpang.\nOrang-orang yang gak pernah melakukan kesalahan sesungguhnya adalah orang yang gak berbuat apa-apa.</p>\n<p>Tapi bisa gak sih, orang yang gak berpendidikan tinggi, punya mental driver?\nTentu bisa, tapi seorang driver tidak cukup hanya bermodalkan tekad dan semangat, lo butuh referensi dari pengetahuan akademis dan belajar dari orang lain.\nIntinya cara berpikir yang tepat adalah modal penting.</p>\n<p>Persoalan perubahan yang dihadapi manusia bukanlah mengadopsi hal-hal baru, melainkan sulitnya membuang kebiasaan lama. - Albert Einstein.</p>\n<h2 id=\"02-manusia-berpikir\">02: Manusia Berpikir<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#02-manusia-berpikir\"></a></h2>\n<p>Mengambil kutipan dari George Bernarr Shaw,</p>\n<blockquote>\n<p>Hanya 2 persen dari orang orang berpikir, 2 persen berpikir kalo dia berpikir dan 95 persen memilih mati dari pada berpikir.</p>\n</blockquote>\n<p>Apa yang terjadi dengan 95 persen itu?\nMereka terperangkapdalam mentalitas penumpang yang memilih menunggu ketimbang berinisiatif,\ngak merasa perlu mengeksplorasi jalan-jalan baru sehingga hanya tau jalan yang itu-itu saja,\ngak merasa perlu merawat kendaraan hidupnya, sehinga boleh mengantuk bahkan tertidur selama perjalanan karirnya yang mudah itu.\nMaksudnya autopilot.</p>\n<p>Dari sejumlah orang yang menekuni profesi tertentu. Hanya kurang dari 2% yang benar-benar serius dan mengembangkan dirinya.\nYang lain terperangkap dalam mentalitas penumpang yang memilih untuk menunggu.</p>\n<p>Setiap manusia memiliki kendaraannya sediri. Pandangilah diri lo di cermin.\nJangan lihat sepotong-sepotong namun lihatlah seluruh tubuh lo dari ujung rambut hingga ujung jari.\nYa, itulah kendaraan lo. Dialah teman setia yang menemani diri lo kemanapun lo pergi. Dialah yang mengantarkan mimpi-mimpi lo sampai ketujuan.</p>\n<p>Setiap orang memiliki kendaraan yang kita sebut dengan diri. Dan dalam diri itu terdapat mentalitas atau jowa pembawa diri itu.\nMaka itulah kita bisa membedaka kedalamdua kategori mental: mentalitas penumpang dan mentalitas pengemudi.</p>\n<p>Menjadi pengemudi bukanlah sekedar menyetir dan memiliki surat izin.\nBanyak manajer memegang legalitas untuk memimpin tetapi tak banyak berbuat dalam posisinya itu.\nJabatan tinggi tapi belum tentu bisa disebut sebagai driver.</p>\n<p>Akibat yang terjadi jika bermental penumpang.</p>\n<ol>\n<li>Kurang kemandirian, cepat menyerah</li>\n<li>Dikendalikan oleh kehidupan \"rutin\" menjadi autopilot</li>\n<li>Mudah mengeluh dan bersungut-sungut sepanjang hidup</li>\n<li>Tidak tahu alternatif jalan keluar</li>\n<li>Mudah frustasi ketika suatu keadaan berubah tiba-tiba</li>\n<li>Kurang berhasil dalam karir dan usaha</li>\n<li>Menjadi boros meski tujuannya berhemat.</li>\n</ol>\n<p>Prinsip seorang diver adalah inisiatif, melayani, navigasi dan tanggung jawab.\nIa harus tau arah jalan dan cara memperbaiki serta merawat kendaraan.\nSadar bahwa sesuatu hanya akan menjadi lebih baik bila lo sendiri yang mengubahnya.\nLo adalah penentu masa depan, baik masa depan diri sendiri, keluarga maupun perusahaan tempat lo berada.\nDan lo juga penentu nasib bangsa. </p>\n<p>Kuncinya adalah berpikir, keluar dari sangkar emas.</p>\n<p>Mentalitas penumpang ditandai dengan:</p>\n<ul>\n<li>Sudah puas dengan keadaan sekarang</li>\n<li>Tidak menyukai tantangan baru</li>\n<li>Menyerahkan masalah kepada atasa atau orang lain</li>\n<li>Takut menghadapi masalah</li>\n<li>Menunggu perintah dan menjawab dengan kata \"siap\"</li>\n<li>Sangat mencintai jawaban atau kekuasannya</li>\n<li>Dikendalikan oleh autopilot</li>\n<li>Terlalu membanggangkan apa yang telah dicapai</li>\n<li>Menyandera organisasi sebagai alat untuk \"menumpang hidup\"</li>\n</ul>\n<p>Mentalitas driver ditandai dengan:</p>\n<ul>\n<li>Sangat tidak puas dengan keadaan sekarang</li>\n<li>Menyukai tantangan-tantangan baru, mengeksplorasi peluang-peluang baru</li>\n<li>Memecahkan masalah bersama, menginspirasi orang lain.</li>\n<li>Berkerja dengan hati, mencintai semama, menjaga hubungan baik, memiliki kepedulian.</li>\n<li>Memimpin dengan pertanyaan, memperbaiki cara berpikir penumpang-penumpangnya.</li>\n<li>Memberikan arah jalan yang jelas, merangkul orang-orang yang berbeda paham dengannya</li>\n<li>Berani melakukan kesalahan-kesalahan kecil dan mengambil resiko terukur.</li>\n<li>Sangat mencintai perubahan, namun rendah hati dan penuh empati</li>\n<li>Dikendalikan oleh creative thinking</li>\n<li>Selalu belajar tentang hal-hal baru</li>\n<li>Membebaskan para sandera dari penumpang yang membajak organisasi</li>\n</ul>\n<p>Untuk menjadi seorang driver, maka diri lo sendiri yang menentukannya.\nLo sendiri yang mentukan mau terperangkap sebagai penumpang atau keluar sebagai pemimpin</p>\n<p>Seorang driver melakukan investasi diri seperti layaknya seorang pengusaha.</p>\n<ul>\n<li>Dispilin diri</li>\n<li>Menghadapi resiko</li>\n<li>Bermain untuk menang</li>\n<li>Kekuatan berpikir simple</li>\n<li>2C critical &#x26; creative thinking</li>\n<li>Mindset yang tumbuh</li>\n</ul>\n<p>Seorang driver tidak akan tumbuh hanya dengan kekuatan dari dirinya sendiri, tapi juga tumbuh dengan kekuatan orang lain.\nBantulah orang lain agar mereka juga berhasil.</p>\n<p>Seorang driver bertugas membawa penumpang ke tempat tujuannya agar mampu meneruskan perjalanan berikutnya.\nSedangkan seorang passanger tidak memperdulikan orang orang disekitarnya.</p>\n<p>Seorang driver mengambangkan orang lain dengan berbagai pendekatan:</p>\n<ul>\n<li>Goal setting dan mengambil keputusan</li>\n<li>Memimpin dengan hatinya</li>\n<li>Kekuatan memberi</li>\n<li>Leadership 360 ke atas keawah dan kesamping</li>\n</ul>\n<p>Kalo lo udah berhasi drive diri lo, drive orang lain, maka yang ketiga adalah drive organisasi lo.\nSeorang driver tidak membarkan organisasinya tidak tumbuh. Lo perlu memperbarui organisasi atau perusahaan lo menjadi perushaan yang tumbuh.</p>\n<p>Untuk men-drive orgnisasi, seorang driver memerlukan.</p>\n<ul>\n<li>Berpikir strategis</li>\n<li>Berbagai teori klasik, konsep-konsep dasar dan pandangan baru.</li>\n<li>Pemahaman tentang competitiveness dan klaster yang didukung oleh pentingnya complementarity.</li>\n<li>Berpkir perubahan dan adaptif</li>\n<li>Berkerja dengan tata nilai dan etika</li>\n<li>Agility</li>\n</ul>\n<h2 id=\"03-mengapa-kaum-muda-memilih-universitas\">03: Mengapa Kaum Muda Memilih Universitas<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#03-mengapa-kaum-muda-memilih-universitas\"></a></h2>\n<p>Sebagian orang menganggap perkembangan data orang yang masuk universitas makin banyak adalah sesuatu yang mengembirakan.\nBenarkah ini kabar gembira? Belum tentu, kenapa? karena banyak sekali sarjana pengangguran yang tidak siap dengan dunia kerja.\nPara orang tua mengirim anaknya ke universitas agar menjadi sarjana dan mereka berpikir dengan menjadi sarjana anak-anak itu otomatis telah berpikir.\nPada kenyataannya mereka hanya mendapat selembar ijasah dan tetap sulit berkerja.</p>\n<p>Mengapa para sarjana sulit memperoleh pekerjaan?\nKarena semasa menjalani pendidikan mereka tidak berpikir, hanya menghafal.\nPadahal yang dibutuhkan adalah keterampilan dalam memindahkan pikiran kedalam tindakan nyata.\nTindakan hanya bisa didapat melalui latihan yang nantinya tersimpan di mucle memory (myelin).\nSedangkan pengetahuan disimpan di brain memory, brain memory baru bisa berkembang jika manusia melatihnya.\nDan celakanya, mereka tidak mendapatkan ini dibangu kuliah.</p>\n<p>Apakah ada perusahaan tanpa driver? Bisa saja ada, dan gejalanya seperti ini:</p>\n<p>Pertama, Mereka tidak berani mengambil keputusan.\nSelalu ragu ragu dalam bertindak dan menunggu approval orang lain.\nPadalah orang itu sudah berada dipuncak jabatan.</p>\n<p>Kedua, Mereka selalu membutuhkan data.\nData diambil berulang ulang,\ntapi tidak ada rasa percaya diri sehingga organisasi lo berkerja mengumpulkan data terus menerus.</p>\n<p>Ketiga, Waktu berkerja dihabiskan oleh meeting.\nWaktunya gak jelas.\nDan ketika selesai rapat tidak ada keputusan atau masih bingung.</p>\n<p>Keempat, Keputusan justru diambil oleh bawahan menjelang akhir,\ndan bawahan menjadi kurang bersemangat\nbahkan ragu ragu karena atasannya tidak memberi gambaran strategis\ndan menyatukan tindakan para bawahan yang bergerak sendiri sendiri</p>\n<p>Kelima, Perusahaan tidak mengalami kemajuan.\nTetapi atasan berada di dalam jabatannya dalam tempowaktu yang panjang.\nJabatan aman, tapi satu persatu lampu di tempat lo berkerja mulai redup dan tidak ada gantinya.</p>\n<p>Keenam, Banyak masalah tapi tidak ada terobosan.\nSemua mencara aman.\nProgam sudah dibuat, tapi kegiatannya hanya rutin.\nKarena semuanya bersifat formalitas sehingga tidak ada terobosan.</p>\n<p>Kondisi seperti ini membutuhkan \"tentara pembebasan\". Siapa dia? dialah yang disebut driver.\nDia adalah seorang yang berpikir, membuat langkah kreatif juga kritis terhadap informasi dan fakta.</p>\n<p>Bagaimana cara menjadi driver yang menyenangkan dan penumpangnya bisa enjoy.\nLengkapi dan latih mereka agar menjadi jadi driver selanjutnya.</p>\n<h2 id=\"04-dua-jenis-penumpang-bad-and-good-passangers\">04: Dua Jenis Penumpang: Bad And Good Passangers<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#04-dua-jenis-penumpang-bad-and-good-passangers\"></a></h2>\n<p>Ada dua jenis penumpang, penumpang yang baik dan penumpang yang buruk.</p>\n<p>Penulis melakukan action research bersama sejumlah psikolog yang biasa menangani karyawan bermasalah.\nOrang-orang bermasalah ini biasanya menyakitkan bagi orang-orang disekitarnya, termasuk bagi atasan-atasannya.\nKepimimpinannya buruk, prestasi rendah, kurang disukai rekan-rekan kerja, tetapi gak mau mengundurkan diri.\nDitambah lagi, perusahaa tempat mereka berkerja enggan mengambil tindakan apa-apa.</p>\n<p>Ini adalah gejala-gejala dari penumpang yang buruk.</p>\n<ul>\n<li>gemar menyalahkan orang lain</li>\n<li>menjadi sangat agresif</li>\n<li>mudah jengkel</li>\n<li>cepat dan sering mengeluh</li>\n<li>hidup tak terarah</li>\n<li>terlalu cepat menyerah</li>\n<li>pesimistis</li>\n<li>mudah menghasut orang lain untuk menjegal orang-orang baik</li>\n<li>punya kecenderungan membalas dendam</li>\n<li>menarik diri</li>\n<li>hidup penuh kebencian</li>\n<li>tak ada passion</li>\n</ul>\n<p>Perusahaan atau organisasi yang sehat perlu dukungan dari pegawai-pegawainya.\nNamum, kalau pasukan yang dipimpinnya sudah berubah menjadi kumpulan orang-orang yang \"sakit hati\" dan punya banyak kepentingan dan luka batin\nmaka bisa jadi bukan perubahan positif yang didapat, melainkan bumerang.</p>\n<p>Bagaimana mengubah dari penumpang yang buruk menjadi penumpang baik? Ya, segera berubah.</p>\n<p>Berubah artinya selalu dimulai dengan menerima realitas, berdamai dengan diri sendiri, menerima suma dengan lapang dada, introspeksi diri.\nMasalahnya hanya satu, Lo mau apa engga untuk berubah? Mustahil kita mendapatkan hasil yang berbeda dari tindakan yang sama berulang-ulang.</p>\n<h2 id=\"05-dua-jenis-pengemudi-bad-and-good-drivers\">05: Dua Jenis Pengemudi: Bad And Good Drivers<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#05-dua-jenis-pengemudi-bad-and-good-drivers\"></a></h2>\n<p>Dua jenis pengemudi: yang baik dan yang buruk.</p>\n<p>Jika mengambil perumpanaan sopir, Bad driver sama seperti sopir ugal-ugalan.\nIngatlah, the first class car membutuhkan the first class driver.\nPada setiap diri yang memiliki inteligensi yang tinggi, dibutuhkan pengemudi berkualitas tinggi pula.\nOrang-orang yang terlatih akan tahu menempatkan diri, kapan harus berbicara dan kapan harus mendengarkan.\nIa harus tahu pakan harus bergera maju dan kapan harus mundur.</p>\n<p>Mungkin lo banyak menemukan orang-orang hebat yang tidak berada ditempat yang tepat.\nIa adalah good driver, tetapi ia dikelilingi oleh teman-teman yang buruk, yang asal bicara, asal bertindak.\nMereka bergerak cepat, berinisiatif tinggi, tetapi selalu menumbulkan masalah.\nKata-katanya tidak dipikirkan sebelum diucapkan, niatnya belum tentu tulus.</p>\n<p>Orang-orang yang kita sebut sebagai bad drivers akan lebih banyak mengambil energi kita,\nMengaak kita menngunakan tenaga untuk melakukan keributan-keributan ketimbang langkah langkah yang tepat.\nAkibatnya, reputasi kita perlahan0lahan tergerus, semakin terpuruk, semakin tidak dipercaya.</p>\n<p>Bad drivers adalah kumpulan orang-orang yang sakit hati, agresif, mudah tersulut kebencian,\ntak menentukan arah tindakannya, lebih mencari pembenaran ketimbang kebenaran\ndan senang membuat alasan-alasan untuk menutupi kekalahan atau kesalah-kesalahannya.</p>\n<p>Sopir ugal-ugalan ini akan membuat penumpang-penumpang baik belajar cara mengemudi kehidupan yang buruk.\nMereka akan menjadi orang yang mencari pembenaran dan senang memancing keributan.\nMereka hanya dapat dilibatkan kembali setelah lulus dari proses terapi diri,sebuah proses yang harus dimulai kembali.\nAtau melakukan self healing yang datang dari dalam diri sendiri.</p>\n<p>Lalu siapakah yang bisa disebut dengan good drivers?</p>\n<p>Good diver adalah seorang inisiator, tokoh perubahan dan mampu menjadi role model bagi banyak orang. </p>\n<p>Lalu bagaimana cara menjadi good driver?\nBisa dengan latihan assertiveness /seni bertutur kata, menampilkan gerak-isyarat yang menunjukan ketegasan namun tetap bersahabat.\nLo dilatih untuk berbicara secara terbuka, menyampaikan unek-unek dan hak lo.\nNamun dengan seni yang tinggi lo bisa sampaikan tanpa merendahkan diri lo atau orang lain.\nMalah mereka dapat menerima dengan hormat karena lo menegurnya dengan cara halus, santun dan tidak menyakiti perasaannya.</p>\n<p>Ini bukan sekedar bahasa melaikan perasaan dan kedewasaan, kepercayaan diri, dan gesture. Melalui latihan itu lo dibangkitkan kesadaran diri (self awarenes).\nKemampuan bernegosiasi, mencaca isyarat, mengurangi agresivitas memperbaiki tone dan komunikasi.</p>\n<p>Latihan selanjutnya adalah berfikir dalam kotak baru. </p>\n<p>Befikir out of the box adalah latihan awal seorang passenger untuk menjadi seorang driver.\nIa harus memiliki kemampuan mencoba jalan jalan baru, keluar dari jalur-jalur utama, mengambil resiko tersesat tanpa harus melanggar hukum.\nMaka, ia pun mengenal peta besar, biasa melihat dari luar maupun dari dalam.</p>\n<p>Lalu apa itu berfikir dalam kotak baru?</p>\n<p>Konsep ini diperkenalkan loleh Luc De Brabandere dan alan Iny pada tahun 2013.\nIni disebabkan oleh banyak hal yang telah ditemukan oleh manusia, sehingga ruang bagi lo untuk menemukan sesuatu yang bener-benar baru sangat terbatas.\nJadi yang dibutuhkan adalah cara baru dalam memandang segala hal yang sudah exist itu.\nMisalnya, Coba lo membayangkan seakan-akan perusahaan atau pemerintahan yang lo pimpim telah benar-benar lenyap. Mulailah dari awal.</p>\n<p>Berpikir dengan cara-cara baru itu akan memudahkan seseorang berubah dari passanger menjadi driver.\nPandanglah dengan segala potensinya dengan cara-carabaru.</p>\n<blockquote>\n<p>Saya kasihan melihat anak-anak kita yang sesungguhnya bisa menjadi lebih hebat,\ntetapi kirang dipercaya orangtua.\nBerikan kepercayaan, tantangan dan dukungan, maka mereka dapat menjadi lebih hebat lagi.\nJangan kekang, hambat atau jadikan mereka passanger.\nTrihatma Kusuma Haliman - Fouunder Podomoro University</p>\n</blockquote>\n<h2 id=\"06-self-dicipline\">06: Self Dicipline<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#06-self-dicipline\"></a></h2>\n<h2 id=\"07-ambilah-resiko\">07: Ambilah Resiko<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#07-ambilah-resiko\"></a></h2>\n<h2 id=\"08-play-to-win\">08: Play to Win<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#08-play-to-win\"></a></h2>\n<h2 id=\"09-the-power-of-simplicity\">09: The Power Of Simplicity<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#09-the-power-of-simplicity\"></a></h2>\n<h2 id=\"10-creative-thinking\">10: Creative Thinking<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#10-creative-thinking\"></a></h2>\n<h2 id=\"11-critical-thinking\">11: Critical Thinking<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#11-critical-thinking\"></a></h2>\n<h2 id=\"12-growth-mindset\">12: Growth Mindset<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#12-growth-mindset\"></a></h2>\n<h2 id=\"13-epilog\">13: Epilog<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#13-epilog\"></a></h2>\n<p>Pembentukan mental dan karakter semasa muda itu sangat menentukan.\nPembentukan mental itu mencangkup ketrampilan-keterampilan hidup dasar yang membentuk fondasi kepemimpinan seseorang,\nsekaligus fondasi ekonomi satu bangsa.\nMentalitas passenger pada dasarnya terbentuk karena kurang terlatihnya lif skills seseorang sehingga individu itummenjadi tidak cekatan dan terbelenggy.\nExecutive function dan self regulationnya tidak jalan.\nTerdapat indikasi kuat anak-anak muda sangat tidakfokus dalam berkerja.\nPikirannya bercabang-cabang, lambat laun mereka akan sangat mengandalkan corporate branding sehingga inisiatif mereka untuk mendatangi dan melaynikurang kuat.\nUmumnya punya ilmu, tetapi maaf \"malas\" menggunakan ilmu-ilmu yang mereka miliki untuk berpikir, menalisis, mencari penyebab dan memecahkan masalah-masalah yang dihadapi.</p>\n<p>Kalau tidak kita bentuk, maka mereka akan lebih banyak mengeluh karena semakin hari semakin terlihat tidak berkarya, lalu terancam berbagai sanksi.\nMulailah mereka merasa diperlakukan kurang adil karena gaji teman-temannya yang lebih muda naik lebih cepat, posisi para driver melonjak tinggi sementara mereka tetap dibawah.\nMenjadi compainer dan terlihat kumuh, kurang mampu membeli kesejahteraan dan kebahagiaan.</p>\n<p>Setiap passenger bisa memlih, menjadi bad atau good atau sekalian menjadi bad driver.\nDan perusahaan ayau institusi pun punya piliham\"\nmemasukan mereka ke dalam lemari es atau melakukan transformasi.</p>\n<p>Kaum muda perlu dilatih tiga hal:</p>\n<ul>\n<li>working memory (kemampuan menata informasi)</li>\n<li>inhibitory control (tahu dan tidak melakukan apa yang tidak boleh diucapkan /dilakukan) /pengendalian diri</li>\n<li>cognitive flexiibility (kemampuan beradaptasi)</li>\n</ul>\n<p>Ketiga hal itulah yang akan membentuk generasi emas yang bertanggung jawab dan produktif.\nMereka sedari dini perlu dibentuk untuk berkerja secara efektif, fokus, tahu dan berkerja dengan aturan, sikap positif terhadap oranglain, mengatasi ketidaknyamanan dan permintaan yang beragam, serta cara mengelola infirmasi yang datang bertubi tubi.</p>\n<p>Memberikan tantangan pada kamumuda atau pegawai  itu penting. Bahkan, lebih pending dari sekadar pujian.\nTantangan yang dibasakan akan melatih working memory, fokus, dan cognitive flexibilitu seseorang.\nDan ini sangat menentukan kualias seseorang untuk menjadi driver atau passenger.</p>\n<p>Hidup yang indah adalah hidup yang bermanfaat, bermatabat dan tumbuh.</p>\n<blockquote>\n<p>Jika anda ingin menaklukan rasa takut, jangan berpangku tangan didalam rumah dan diam didepannya.\nPergilah keluar, temui banyak orang dan buatlah diri anda sibuk.</p>\n<ul>\n<li>Dale carnegie</li>\n</ul>\n</blockquote>\n<hr>\n<h2 id=\"tags\">Tags<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#tags\"></a></h2>\n<ol>\n<li><a class=\"color-tag\" style=\"--tag-color: #2c6fbb;\" href=\"/sotoy/notes/8mz3dc3neqofv79za5ey5jp\">Self Improvement</a></li>\n<li><a class=\"color-tag\" style=\"--tag-color: #d3494e;\" href=\"/sotoy/notes/2s2ic9ajltco1l0einjx23g\">Rhenald Kasali</a></li>\n</ol>","noteIndex":{"id":"oqxmejlafk9x8rj9t5hya5z","title":"Hi 👋","desc":"","updated":1721116613997,"created":1646842475821,"custom":{"nav_order":0,"permalink":"/"},"fname":"root","type":"note","vault":{"fsPath":"vault"},"contentHash":"64c62caa2f0c02c2d68a5a2d826cc01e","links":[],"anchors":{"welcome-to-sotoy":{"type":"header","text":"Welcome to Sotoy","value":"welcome-to-sotoy","line":8,"column":0,"depth":1},"lookup":{"type":"header","text":"Lookup","value":"lookup","line":12,"column":0,"depth":2}},"children":["spfwom01chbihki1twghclf","bsv930j2j6qlih60c7eu7wh","ohf85tu5nw2b8ewx6cetsmp","u3lhhpriar8wgcjw8svapha","tvdcga33h6hi7fxd9cwqd66","t58wEmhAtf1GlHmO","u7j98ka2t55hajzrl5a8oib","91eqybfohputr1iaxqbsbfe","xfsiepyapo4o9u17mvwwmmz","7udjlx2925dhyxgkrntgcbz","x1aw4xgjnlqqzeww7dkz75g","z7qt819xp1pg1nqocan3dgt","x2igauua7kh84r52tyj7o3u","voqvz4ahoyv7bbivylyivw1","ode6u3a9n5hypn4jmcwit7t","wt3mgyiw1rd3tj99r2fam41"],"parent":null,"data":{},"body":"\n# Welcome to Sotoy\n\nThis is the root of your dendron vault. If you decide to publish your entire vault, this will be your landing page. You are free to customize any part of this page except the frontmatter on top.\n\n## Lookup\n\nThis section contains useful links to related resources.\n\n- [Getting Started Guide](https://link.dendron.so/6b25)\n- [Discord](https://link.dendron.so/6b23)\n- [Home Page](https://wiki.dendron.so/)\n- [Github](https://link.dendron.so/6b24)\n- [Developer Docs](https://docs.dendron.so/)\n"},"collectionChildren":null,"customHeadContent":null,"config":{"version":5,"dev":{"enablePreviewV2":true},"commands":{"lookup":{"note":{"selectionMode":"extract","confirmVaultOnCreate":true,"vaultSelectionModeOnCreate":"smart","leaveTrace":false,"bubbleUpCreateNew":true,"fuzzThreshold":0.2}},"randomNote":{},"insertNoteLink":{"aliasMode":"none","enableMultiSelect":false},"insertNoteIndex":{"enableMarker":false},"copyNoteLink":{"aliasMode":"title"},"templateHierarchy":"template"},"workspace":{"dendronVersion":"0.83.0","vaults":[{"fsPath":"vault"},{"fsPath":"templates","seed":"dendron.templates","name":"dendron.templates","visibility":"private"},{"fsPath":"vault2","name":"vault-private","sync":"sync","visibility":"private","remote":{"type":"git","url":"git@github.com:zeihanaulia/journal.git"}}],"journal":{"dailyDomain":"daily","name":"journal","dateFormat":"y.MM.dd","addBehavior":"childOfDomain"},"scratch":{"name":"scratch","dateFormat":"y.MM.dd.HHmmss","addBehavior":"asOwnDomain"},"task":{"name":"","dateFormat":"","addBehavior":"childOfCurrent","statusSymbols":{"":" ","wip":"w","done":"x","assigned":"a","moved":"m","blocked":"b","delegated":"l","dropped":"d","pending":"y"},"prioritySymbols":{"H":"high","M":"medium","L":"low"},"todoIntegration":false,"createTaskSelectionType":"selection2link","taskCompleteStatus":["done","x"]},"graph":{"zoomSpeed":1,"createStub":false},"enableAutoCreateOnDefinition":false,"enableXVaultWikiLink":false,"enableRemoteVaultInit":true,"enableUserTags":true,"enableHashTags":true,"workspaceVaultSyncMode":"noCommit","enableAutoFoldFrontmatter":false,"enableEditorDecorations":true,"maxPreviewsCached":10,"maxNoteLength":204800,"seeds":{"dendron.templates":{}},"enableFullHierarchyNoteTitle":false},"preview":{"enableFMTitle":true,"enableNoteTitleForLink":true,"enableFrontmatterTags":true,"enableHashesForFMTags":false,"enablePrettyRefs":true,"enableKatex":true,"automaticallyShowPreview":false},"publishing":{"enableFMTitle":true,"enableNoteTitleForLink":true,"enablePrettyRefs":true,"enableKatex":true,"copyAssets":true,"siteHierarchies":["root"],"writeStubs":true,"siteRootDir":"docs","seo":{"title":"Sotoy","description":"Personal knowledge space about anything I learn. Notes, knowledge, and ideas from me.","author":"Zeihan Aulia","twitter":"zeihanaulia","image":{"url":"https://pbs.twimg.com/profile_images/502375255256485888/1UYtt7PT_400x400.jpeg","alt":"Software Engineer, "}},"github":{"enableEditLink":true,"editLinkText":"Edit this page on GitHub","editBranch":"main","editViewMode":"tree"},"enableSiteLastModified":true,"enableFrontmatterTags":true,"enableHashesForFMTags":false,"enableRandomlyColoredTags":true,"enableTaskNotes":true,"enablePrettyLinks":true,"searchMode":"lookup","assetsPrefix":"/sotoy","siteUrl":"https://zeihanaulia.github.io","duplicateNoteBehavior":{"action":"useVault","payload":["vault-private","vault","dendron.templates"]},"siteFaviconPath":"favicon.ico","siteIndex":"root"}}},"__N_SSG":true}