{"keys":[{"path":["title"],"id":"title","weight":1,"src":"title"},{"path":["body"],"id":"body","weight":1,"src":"body"}],"records":[{"i":0,"$":{"0":{"v":"This page has not yet sprouted","n":0.408},"1":{"v":"[Dendron](https://dendron.so/) (the tool used to generate this site) lets authors selective publish content. You will see this page whenever you click on a link to an unpublished page\n\n![](https://foundation-prod-assetspublic53c57cce-8cpvgjldwysl.s3-us-west-2.amazonaws.com/assets/images/not-sprouted.png)","n":0.189}}},{"i":1,"$":{"0":{"v":"Root","n":1},"1":{"v":"# Welcome to Dendron\n\nThis is the root of your dendron vault. If you decide to publish your entire vault, this will be your landing page. You are free to customize any part of this page except the frontmatter on top.\n\n## Lookup\n\nThis section contains useful links to related resources.\n\n- [Getting Started Guide](https://link.dendron.so/6b25)\n- [Discord](https://link.dendron.so/6b23)\n- [Home Page](https://wiki.dendron.so/)\n- [Github](https://link.dendron.so/6b24)\n- [Developer Docs](https://docs.dendron.so/)\n","n":0.132}}},{"i":2,"$":{"0":{"v":"Books","n":1}}},{"i":3,"$":{"0":{"v":"Self Improvement","n":0.707}}},{"i":4,"$":{"0":{"v":"Darren Hardy","n":0.707}}},{"i":5,"$":{"0":{"v":"The Compound Effects","n":0.577},"1":{"v":"\n# The Compound Effect\n\nHal besar tidak terjadi dalam semalam, melainkan hal kecil yang dikumpulkan dan menjadi kebiasaan.\n\nhttps://go.darrenhardy.com/the-compound-effect-resources/\n\n## The Compound Effect in Action\n\nChapter pertama judulnya The Compound Effect in Action.\n\nCompound efek itu adalah pilihan-pilihan yang kecil yang baik, efektif dan dilakukan secara konsisten.\nDan dipilih secara sadar bukan autopilot.\n\n```\nSMALL, SMART CHOICES + CONSISTENCY + TIME = RADICAL DIFFERENCE\n```\n\n> Kalian pilih yang mana? dapet uang 3 juta dolar didepan atau 1 sen yang berlipat ganda selama 30 hari.\n\nJika kita pilih 3 juta didepan, ya sudah tidak akan ada penambahan lagi dihari hari berikutnya.\nTapi jika kita pilih 1 sen yang berlipat ganda kita akan mendapat total lebih dari 10juta di hari ke 30.\n\nJika pilihan yang kecil dibuat secara konsisten maka akan menghasilkan sesuatu yang besar.\n\nMisalnya seperti pada cerita kura-kura dan kelinci.\n\nTaukan yang akhirnya siapa? ya, yang menang adalah si kura kura yang lambat.\n\nKura-kura memang pelan, tapi dia konsisten selangkah demi selangkah berjalan hingga sampai tujuan.\nSedangkan kelinci yang cepat tapi tidak fokus sehingga tidak pernah sampai ke tujuan.\n\n### Action Step\n\n- Kita harus bertanggung jawab dengan diri kita sendiri.\n- Tuliskan 6 langkah positif yang bisa dilakukan secara konsisten setiap hari.\n- Tuliskan 6 langkah negatif yang ingin kita hentikan.\n- Identifikasikan area dimana dulu kita pernah sukses, tapi tidak melakukannya lagi karena sudah berpuas diri.\n\n## Choices\n\nChapter kedua judulnya Choices atau pilihan-pilihan.\n\nSemua dimulai dari sebuah pilihan.\n\nTidak mungkinkan, dalam semalam berat badan kita naik hingga 100kg.\nItu adalah hasil dari pilihan-pilihan buruk kita dimasa lalu.\n\nLalu bagaimana kita menjadi lebih baik dengan memilih pilihan yang tepat?\n\nJawabannya adalah berhenti hidup dengan autopilot dan mulai keputusan dengan sadar dan bertanggung jawab atas pilihan yang kita pilih.\n\nIngat keberuntungan adalah Preparation + Attitude + Opportunity + Action.\n\n> How? “You can’t manage what you can’t measure,” so choose to start tracking every action in the part of life that you’re focussing on.\n\nLalu, bagaimana kita bisa mengatur sesuatu yang kita gak bisa ukur?\nYa pilihannya kita bisa mulai melakukan \"tracing\" dari setiap aksi yang paling kita fokusin.\n\nContoh,\n\nMisalnya kita ingin menurunkan berat badan, caranya:\n\n- Track berat badan\n- Track ukuran badan\n- Track kalori\n- Track steps\n- Track waktu latihan setiap hari\n\n<!-- TODO: Bikin contoh cerita -->\n\n### Action Step\n\n- Identifikasi satu hal yang paling kalian perjuangkan lalu mulai buat journal yang kita syukuri.\n- Identifikasi satu hal kehidupan yang ingin kalian ubah dan kalian tidak bertanggung jawab 100%.\n- Start tracking setidaknya satu hal yang ingin diubah dan ditingkatkan.\n\n## Habits\n\nChapter ketiga judulnya habits atau kebiasaan.\n\nMembuat habit baru memang membutuhkan waktu, sabar dengan diri sendiri.  Jika kita gagal jangan menyalahkan diri sendiri atau siapapun. Mulai coba kembali.\n\nBagaimana kita mengambil tanggung jawab akan habit kita?\n\n- Kita harus mengetahui impact dari habit yang kita lakukan terhadap hidup kita.\n- Tetukan \"Why?\" yang memotivasi untuk mengubah perilaku.\n- Hilangkan kebiasaan buruk.\n- Buat kebiasaan baik yang akan mencapai tujuan kita.\n\n<!-- TODO: Bikin contoh cerita -->\n\n## Momentum\n\nChapter keempat judulnya momentum.\n\nDibuku ini ada yang namanya the big mo.\nKalau kita bisa menjaga perilaku baik dalam jangka waktu yang cukup lama, kemungkinan besar kita akan masuk kedalam ritme yang alami secara konsisten.\nSaat kita sudah mengikuti ritme ini, kita akan terus membuat keputusan yang lebih baik.\n\nKalau sudah mulai, jangan berhenti. Jika berhenti kita bukan saja kehilangan semua kerja keras sebelumnya, tapi kita juga kehilangan momentum.\n\nKonsistensi dan ketekunan adalah penghasil efek compound.\n\nDibuku ini daren mencontohkan,\n\nDipagi hari dia merefleksi diri dengan 3 hal yang disyukuri. lalu memvisualisasikan apa yang mau dicapai dihari itu.\nLalu buat 3 aksi nyata untuk mewujudkannya.\n\nLalu retrospeksi dimalam hari tentang apa yang dilakukannya hari ini. Refleksikan apa yang dipelajari dihari ini.\nApa yang bisa membuat hari esok jadi lebih baik.\n\n<!-- TODO: Bikin contoh cerita -->\n\n### Action Step\n\n- Bikin list dimalam hari dan morning routines.\n- List 3 hal dimana lo gak cukup konsisten.\n\n## Influences\n\nChapter kelima judulnya influences atau pengaruh\n\nSalah satu langkah penting dalam memperbaiki kebiasaan adalah pengaruh.\nKita harus pintar-pintar memilah informasi. Otak kita adalah mesin pemroses informasi. garbage in, garbage out.\n\nBagaimana caranya menjaga informasi yang masuk?\n\n1. Pilih media yang memberikan informasi mendekati tujuan kita dan hindari informasi berita berita tidak penting.\n2. Pilih asosiasi atau inner circle yang tepat, yang suportif dan menginpirasi.\n    - Evaluasi asosiasi saat ini. Apakah kita dikelilingi orang-orang yang cinta, mendukung dan menginspirasi?\n    - Visualisasi ideal asosiasi. Kalau boleh berangan angan kira kira teman seperti apa yang kita mau?\n    - Singkirkan yang terburuk sepenuhnya. Temukan cara untuk menjadu dari bad actor.\n    - Batasi pertemanan, kualitas lebih penting dari kuantitas.\n    - Perluas dan tiru yang baik.\n3. Pilih lingkungan yang tepat.\n\n### Action Step\n\n- Identifikasi pengaruh media dan informasi didalam hidup kita. Identifikasi cara untuk memproteksi dari informasi negatif.\n- evaluasi asosiasi saat ini. Mana yang harus dihentidan atau dibatasi? lalu bagai mana kita memperluas pertemanan yang baik.\n- identifikasi 3 hal yang paling kita fokusin untuk diimprove. cari mentor disetiap area tersebut. \n\n## Acceleration\n\nChapter keenam judulnya acceleration atau mempercepat.\n\nHadapilah rintangan bukan sebagai masalah, tetapi sebagai kesempatan.\nPerlu diingat pertumbuhan akan terlihat jika kita berhasil melewati rintangan-rintangan.\nDengan adanya rintangan kita dikasi kesempatan untuk belajar.\n\nSemua orang mungkin menghadapi masalah yang sama, tapi kebanyakan dari mereka menyerah begitu saja.\n\nBerdiri dan keluarlah, lakukan hal hal yang tidak terduga. carilah sebanyak mungkin peluang yang mengejutkan.\nAmbil aksi yang luar biasa. Manfaatkan compound efek dan kita akan menemukan cara untuk memulai pendapatan, kehidupan dan kesuksesan.\n\nMisalnya, Kalau kita sudah rutin berolah raga dipagi hari dan kita pikir kita hanya kuat push up sebanyak 50 kali.\nCoba paksakan diri kamu untuk menambahkan 20 kali lagi. Dengan cara seperti ini kita bisa menembuat ambang batas yang baru.\n\n\n### Action Step\n\n- Identifikasi waktu ketika kita mencapai moment of truth dan berkomitmen untuk sampai disana.\n- Temukan 3 hal didalam hidup kita dimana kita bisa melakukan \"extra\" dan membuat rencana untuk melakukan lebih.\n- Identifikasi 3 hal didalam hidup kita yang melewati ekspektasi lalu rencankan dan bahanya mana cara membuat \"wow\" moment.\n- Identifikasi 3 cara dimana kita bisa melakukan hal-hal yang tak terduga. Temukan perbedaan antara umum, normal dan expected.\n\n## Lesson Learn\n\nKita tidak bisa mengubah hidup kita hingga rutinitas kita berubah.\n\n1. Terima kekuatan compounding\n2. Buat dan track pilihan pilihan secara sadar\n3. Tumbuhkan kebiasaan positof dan membuang kebiasaan buruk.\n4. Set up rutin harian dan mingguan.\n5. Optimasi lingkungan\n6. Ambil aksi yang luar biasa.\n\nTerdengan sederhana tapi susah buat dikerjakan.","n":0.032}}}]}
